In [37]:
import pandas as pd
import numpy as np
import seaborn as sns
import matplotlib.pyplot as plt
import sklearn as sk

In [38]:
df = pd.read_csv('titanic_test.csv', index_col=0)
df.head()

,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
PassengerId,,,,,,,,,,
892,3,"Kelly, Mr. James",male,34.5,0,0,330911,7.8292,NaN,Q
893,3,"Wilkes, Mrs. James (Ellen Needs)",female,47.0,1,0,363272,7.0000,NaN,S
894,2,"Myles, Mr. Thomas Francis",male,62.0,0,0,240276,9.6875,NaN,Q
895,3,"Wirz, Mr. Albert",male,27.0,0,0,315154,8.6625,NaN,S
896,3,"Hirvonen, Mrs. Alexander (Helga E Lindqvist)",female,22.0,1,1,3101298,12.2875,NaN,S

In [39]:
def percent_nan(df):
    percent_nan = df.isnull().sum() / len(df) * 100
    percent_nan = percent_nan[percent_nan > 0].sort_values(ascending=False)
    return percent_nan

In [40]:
percent_nan(df)

Cabin    78.229665
Age      20.574163
Fare      0.239234
dtype: float64

In [41]:
df.drop(['Name', 'Ticket'], axis=1, inplace=True)
df['Cabin'].fillna(value = 'None', inplace=True)
df = pd.get_dummies(df, columns=['Sex'], drop_first=True, )
df.drop(['Cabin'], axis=1, inplace=True)
df['Embarked'].groupby(df['Embarked']).count()
df = pd.get_dummies(df, columns=['Embarked'])
df['Age'].fillna(value = df['Age'].mean(), inplace=True)

In [42]:
percent_nan(df)

Fare    0.239234
dtype: float64

In [43]:
df['Fare'].fillna(value = df['Fare'].mean(), inplace=True)

In [44]:
df.head()

,Pclass,Age,SibSp,Parch,Fare,Sex_male,Embarked_C,Embarked_Q,Embarked_S
PassengerId,,,,,,,,,
892,3,34.5,0,0,7.8292,1,0,1,0
893,3,47.0,1,0,7.0000,0,0,0,1
894,2,62.0,0,0,9.6875,1,0,1,0
895,3,27.0,0,0,8.6625,1,0,0,1
896,3,22.0,1,1,12.2875,0,0,0,1

In [45]:
percent_nan(df)

Series([], dtype: float64)

In [46]:
df.to_csv('titanic_test_clean.csv')